Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་སྟོང་པ་ལགས་ན །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི་སྟེ། བཅོམ་ལྡན་འདས་འདི་སྙེད་དོ་ཞེས་བགྱི་བ་འམ། འདི་དག་གོ་ཞེས་བགྱི་བ་དང་།
en: Subhūti then asked, “Blessed Lord, if all phenomena are empty, in what manner should bodhisattva great beings train?

source: འཇིག་རྟེན་པའི་ཆོས་ནི་འདི་དག་གོ །
en: Blessed Lord, would they conceptually elaborate that which is without conceptual elaboration when they say, ‘There are so many of these but [not] of those,’ or ‘These are mundane attributes.

source: འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ནི་འདི་དག་གོ །
en: These are supramundane attributes.

source: ཟག་པ་དང་བཅས་པའི་ཆོས་ནི་འདི་དག་གོ །
en: These are contaminated attributes.

source: ཟག་པ་མེད་པའི་ཆོས་ནི་འདི་དག་གོ །
en: These are uncontaminated attributes. {Ki.

source: འདུས་བྱས་ཀྱི་ཆོས་ནི་འདི་དག་གོ །
en: VIII: 120} These are conditioned attributes.

source: འདུས་མ་བྱས་ཀྱི་ཆོས་ནི་འདི་དག་གོ །
en: These are unconditioned attributes.

source: སོ་སོའི་སྐྱེ་བོའི་ཆོས་ནི་འདི་དག་གོ །
en: These are the attributes of ordinary people.

source: རྒྱུན་དུ་ཞུགས་པའི་ཆོས་ནི་འདི་དག་གོ །
en: These are the attributes of one who has entered the stream to nirvāṇa.

source: ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པའི་ཆོས་ནི་འདི་དག་གོ །
en: These are the attributes of one destined for only one more rebirth, one no longer subject to rebirth, or an arhat.

source: རང་སངས་རྒྱས་ཀྱི་ཆོས་ནི་འདི་དག་གོ །
en: These are the attributes of pratyekabuddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ནི་འདི་དག་གོ །
en: These are the attributes of bodhisattvas.

source: སངས་རྒྱས་ཀྱི་ཆོས་ནི་འདི་དག་གོ །
en: These are the attributes of the buddhas’?” “

source: ཞེས་བགྱི་བ་ནི་སྤྲོས་པ་མ་མཆིས་པ་འཕྲོ་བར་བགྱིད་པའོ།
en: Subhūti, it is so!

source: །རབ་འབྱོར་གལ་ཏེ་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱི། སྟོང་པ་མ་ཡིན་ན་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཆོས་ཐམས་ཅད་ལ་བསླབས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་སྟེ། རབ་འབྱོར་ཆོས་ཐམས་ཅད་སྟོང་པས་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ལ་བསླབས་ཤིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Subhūti, if all phenomena were not empty of inherent existence, bodhisattva great beings, even after training in all phenomena, would not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །རབ་འབྱོར་ཁྱོད་ཀྱིས་གཞན་ཡང་གང་འདི་སྐད་དུ་གལ་ཏེ་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདི་སྙེད་དོ། །ཞེས་བྱ་བ་འམ་འདི་དག་གོ་ཞེས་བྱ་བ་དང་། འཇིག་རྟེན་པའི་ཆོས་ནི་འདི་དག་གོ །
en: Subhūti, you also said that if all phenomena are empty of inherent existence, would bodhisattva great beings differentiate phenomena, saying, ‘There are so many of these but [not] of those,’ or ‘These are mundane attributes.

source: སངས་རྒྱས་ཀྱི་ཆོས་ནི་འདི་དག་གོ་ཞེས་བྱ་བར་ཆོས་རྣམ་པར་དབྱེ་བར་འགྱུར་ཞེས་བྱ་བ་ནི།
en: These are the attributes of the buddhas’?

source: རབ་འབྱོར་ཅི་སེམས་ཅན་འདི་དག་གིས་དེ་ལྟར་ཆོས་ཐམས་ཅད་སྟོང་ངོ་ཞེས་བྱ་བར་ཤེས་སམ།
en: As far as that is concerned, Subhūti, do beings know that all phenomena are empty?

source: གལ་ཏེ་ཤེས་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཆོས་ཐམས་ཅད་ལ་བསླབས་ཤིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་བྱེད་དེ།
en: If they did know that, even bodhisattva great beings would not train in all phenomena and then attain all-aspect omniscience.

source: རབ་འབྱོར་སེམས་ཅན་འདི་དག་ཆོས་ཐམས་ཅད་སྟོང་ངོ་ཞེས་བྱ་བར་མི་ཤེས་པས། དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཆོས་རྣམ་པར་དགོད་པ་བྱས་ཤིང་། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ།
en: However, Subhūti, it is because these beings do not know that all phenomena are empty that bodhisattva great beings do attain consummate buddhahood in unsurpassed, complete enlightenment, and then establish the Dharma and teach the Dharma to beings. “

source: །རབ་འབྱོར་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ལམ་ལ་སྤྱོད་པས། ཐོག་མ་ཉིད་དུ་འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། མངོན་པར་འདུ་བྱ་བ་མ་གཏོགས་པར་འདི་ལ་ཆོས་གང་ཡང་ངོ་བོ་ཉིད་ཀྱིས་དམིགས་སུ་མེད་དོ། །ཞེས་བྱ་བར་ཡོངས་སུ་བརྟག་པར་བྱའོ། །དེ་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ལ་དེ་ལྟར་རྟོགས་པས། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་སམ།
en: In this regard, Subhūti, bodhisattva great beings, when they practice the bodhisattva path, should at the outset make the following observation: ‘Herein there is nothing at all apart from conditioning that can be apprehended in terms of the essential nature.’

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དམ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ནམ། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་སམ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སམ། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་འམ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དམ། རང་བྱང་ཆུབ་བམ།
en: Since they realize the essential nature of all phenomena in that manner, they do not become fixated on anything at all—whether it be the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great compassion, the distinct qualities of the buddhas, the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, or [the goals], up to and including unsurpassed, complete enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་རམ། ཆོས་གང་ལ་ཡང་མངོན་པར་ཆགས་པར་མི་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་ཀྱིས་སྟོང་སྟེ། སྟོང་པ་ཉིད་ནི་སྟོང་པ་ཉིད་ལ་མངོན་པར་ཞེན་པར་མི་འགྱུར་རོ།
en: If you ask why, it is because all phenomena are empty of essential nature, and emptiness does not become fixated on emptiness.

source: །སྟོང་པ་ཉིད་ཀྱང་དམིགས་སུ་མེད་ན། གང་སྟོང་པ་ཉིད་ལ་མངོན་པར་ཞེན་པར་འགྱུར་བ་ལྟ་ཅི་སྨོས་ཏེ།
en: Since they do not apprehend even emptiness, how could they possibly be fixated on emptiness! {

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པར་ཆོས་ཐམས་ཅད་ཀྱིས་རྣམ་པར་སྤྱོད་དོ།
en: Ki.VIII: 121} So it is, Subhūti, that bodhisattva great beings engage with all phenomena, but are without fixation with respect to all phenomena. “

source: །དེ་བསླབ་པ་འདི་ལ་གནས་ཤིང་སེམས་ཅན་འདི་དག་ཅི་ལ་སྤྱོད་ཅེས་སེམས་ཅན་གྱི་སྤྱོད་པ་ལ་ལྟ་སྟེ།
en: Maintaining this training, they examine the conduct of all beings.

source: དེ་འདི་སྙམ་དུ་ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ཡང་དག་པ་མ་ཡིན་པའི་འཛིན་པ་ལ་སྤྱོད་དེ།
en: Wondering what these beings are practicing, they think, ‘Alas! These beings are engaged in grasping at that which does not exist! Alas!

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ཡང་དག་པ་མ་ཡིན་པའི་འཛིན་པ་ལས་དགྲོལ་བར་བྱ་ན་དཀའ་བ་བྱེད་དོ་ཞེས་ནས་དེའི་ཚེ་ཐབས་མཁས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ།
en: It makes it difficult if these beings are to be freed from grasping at that which does not exist.’ “

source: འདི་སྐད་དུ་སྟོན་ཏོ།
en: At that time, while maintaining the perfections, through skill in means they instruct them as follows: ‘Come here, beings!

source: །ཀྱེ་སེམས་ཅན་དག་ཚུར་ཤེག་སྦྱིན་པ་བྱིན་ཅིག །
en: Dispense generosity and you will have resources!

source: དེས་ཁྱོད་ལོངས་སྤྱོད་དང་ལྡན་པར་འགྱུར་གྱིས་ལོངས་སྤྱོད་དེས་ཀྱང་རློམ་སེམས་སུ་མ་བྱེད་ཅིག་དེ་ལ་སྙིང་པོ་གང་ཡང་མེད་དོ།
en: Do not give rise to conceits on account of these resources! They lack even the slightest essence!’

source: །དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་ལ་འདེམས་ཏེ། ཀྱེ་སེམས་ཅན་དག་ཚུར་ཤེག །
en: Similarly, they should instruct them in ethical discipline, saying, ‘Come here, beings!

source: ཚུལ་ཁྲིམས་སྲུངས་ཤིག་ཚུལ་ཁྲིམས་དེས་ཀྱང་རློམ་སེམས་སུ་མ་བྱེད་ཅིག །
en: Keep [the vows of] ethical discipline, and do not give rise to conceits on account of that ethical discipline.

source: དེ་ལ་སྙིང་པོ་གང་ཡང་མེད་དོ།
en: It lacks even the slightest essence!’

source: །དེ་བཞིན་དུ་བཟོད་པ་ལ་འདེམས་ཏེ། ཀྱེ་སེམས་ཅན་དག་ཚུར་ཤེག །
en: Similarly, they should instruct them in tolerance, saying, ‘Come here, beings!

source: བཟོད་པ་སྒོམས་ཤིག །བཟོད་པ་དེས་ཀྱང་རློམ་སེམས་སུ་མ་བྱེད་ཅིག །
en: Cultivate tolerance, and do not give rise to conceits on account of that tolerance.

source: །དེ་བཞིན་དུ་བརྩོན་འགྲུས་ལ་འདེམས་ཏེ། ཀྱེ་སེམས་ཅན་དག་ཚུར་ཤེག །
en: Similarly, they should instruct them in perseverance, saying, ‘Come here, beings!

source: བརྩོན་འགྲུས་རྩོམས་ཤིག །བརྩོན་འགྲུས་དེས་ཀྱང་རློམ་སེམས་སུ་མ་བྱེད་ཅིག །
en: Undertake acts of perseverance, and do not give rise to conceits on account of that perseverance.

source: །དེ་བཞིན་དུ་ཏིང་ངེ་འཛིན་ལ་འདེམས་ཏེ། ཀྱེ་སེམས་ཅན་དག་ཚུར་ཤེག །ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་ཞོག་ཤིག །
en: Similarly, they should instruct them in meditative stability, saying, ‘Come here, beings!

source: ཏིང་ངེ་འཛིན་དེས་ཀྱང་རློམ་སེམས་སུ་མ་བྱེད་ཅིག །
en: Be absorbed in meditative stability, and do not give rise to conceits on account of that meditative stability.

source: །དེ་བཞིན་དུ་ཤེས་རབ་ལ་འདེམས་ཏེ། ཀྱེ་སེམས་ཅན་དག་ཚུར་ཤེག །ཤེས་རབ་སྒོམས་ཤིག །
en: Similarly, they should instruct them in wisdom, saying, ‘Come here, beings!

source: ཤེས་རབ་དེས་ཀྱང་རློམ་སེམས་སུ་མ་བྱེད་ཅིག །
en: Cultivate wisdom, and do not give rise to conceits on account of that wisdom.

source: །དེ་བཞིན་དུ་སྟོང་པ་ཉིད་ཐམས་ཅད་ལ་འདེམས་ཏེ། ཀྱེ་སེམས་ཅན་དག་ཚུར་ཤེག །
en: Similarly, they should instruct them in all the aspects of emptiness, saying, ‘Come here, beings!

source: སྟོང་པ་ཉིད་སྒོམས་ཤིག །སྟོང་པ་ཉིད་དེས་ཀྱང་རློམ་སེམས་སུ་མ་བྱེད་ཅིག །
en: Cultivate emptiness, and do not give rise to conceits on account of that emptiness.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་འདེམས་ཏེ། ཀྱེ་སེམས་ཅན་དག་ཚུར་ཤེག །
en: Similarly, they should instruct them in the thirty-seven factors conducive to enlightenment, saying, ‘Come here, beings!

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སྒོམས་ཤིག །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་དེ་དག་གིས་ཀྱང་རློམ་སེམས་སུ་མ་བྱེད་ཅིག །
en: Cultivate the factors conducive to enlightenment, and do not give rise to conceits on account of those factors conducive to enlightenment.

source: དེ་ལ་སྙིང་པོ་གང་ཡང་མེད་དོ། །དེ་བཞིན་དུ་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: They lack even the slightest essence!’ “

source: རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་།
en: Similarly, they should instruct them in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways, saying, ‘Come here, beings!

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་འདེམས་ཏེ། ཀྱེ་སེམས་ཅན་དག་ཚུར་ཤེག །གཟུངས་ཀྱི་སྒོ་རྣམས་སྒོམས་ཤིག །གཟུངས་ཀྱི་སྒོ་དེ་དག་གིས་ཀྱང་རློམ་སེམས་སུ་མ་བྱེད་ཅིག །
en: Cultivate the dhāraṇī gateways [and so forth], and do not give rise to conceits on account of those dhāraṇī gateways [and so forth].

source: །དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་འདེམས་ཏེ།
en: Similarly, they should instruct them in the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great compassion, and the distinct qualities of the buddhas, saying, ‘Come here, beings!

source: ཀྱེ་སེམས་ཅན་དག་ཚུར་ཤེག །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སྒོམས་ཤིག །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དེ་དག་གིས་ཀྱང་རློམ་སེམས་སུ་མ་བྱེད་ཅིག །
en: Cultivate the distinct qualities of the buddhas [and so forth], and do not give rise to conceits on account of those distinct qualities of the buddhas [and so forth].

source: །དེ་བཞིན་དུ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་འདེམས་ཏེ། ཀྱེ་སེམས་ཅན་དག་ཚུར་ཤེག །
en: Similarly, they should instruct them in the fruit of entering the stream to nirvāṇa, saying, ‘Come here, beings!

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་སྒོམས་ཤིག །རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་དེས་ཀྱང་རློམ་སེམས་སུ་མ་བྱེད་ཅིག །
en: Cultivate the fruit of entering the stream to nirvāṇa, and do not give rise to conceits on account of that fruit of entering the stream to nirvāṇa.

source: །དེ་བཞིན་དུ་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ལ་འདེམས་ཏེ། ཀྱེ་སེམས་ཅན་དག་ཚུར་ཤེག །
en: Similarly, they should instruct them in the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment, saying, ‘Come here, beings!

source: རང་བྱང་ཆུབ་སྒོམས་ཤིག །རང་བྱང་ཆུབ་དེས་ཀྱང་རློམ་སེམས་སུ་མ་བྱེད་ཅིག །
en: Cultivate individual enlightenment [and so forth], and do not give rise to conceits on account of that individual enlightenment [and so forth].

source: །དེ་བཞིན་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་འདེམས་ཏེ། ཀྱེ་སེམས་ཅན་དག་ཚུར་ཤེག །
en: Similarly, they should instruct them in [the goals], up to and including all-aspect omniscience, saying, ‘Come here, beings!

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་སྒོམས་ཤིག །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེས་ཀྱང་རློམ་སེམས་སུ་མ་བྱེད་ཅིག །
en: Cultivate all-aspect omniscience [and so forth], and do not give rise to conceits on account of that all-aspect omniscience [and so forth].

source: །ཞེས་དེ་ལྟར་སེམས་ཅན་རྣམས་ལ་འདེམས་པ་དང་། རྗེས་སུ་སྟོན་པ་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལ་སྤྱོད་ཀྱང་གང་ལ་ཡང་མངོན་པར་ཞེན་པ་མེད་དོ།
en: Instructing and advising beings accordingly, they continue to practice the path of the bodhisattvas but do not become fixated on anything at all.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་ཐམས་ཅད་ནི་མངོན་པར་ཞེན་པ་མེད་པ་སྟེ།
en: If you ask why, it is because all phenomena are without fixation.

source: དེ་ནི་འདི་ལྟར་དེ་དག་ལ་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་ཕྱིར་གང་གིས་མངོན་པར་ཞེན་པར་བྱ་བའི་ངོ་བོ་ཉིད་མེད་དོ།
en: Owing to the essential nature of emptiness, they have no essential nature by which bodhisattvas would become fixated. “

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ལམ་ལ་སྤྱོད་ཀྱང་གང་ལ་ཡང་མི་གནས་ཏེ། དེ་གནས་པ་མེད་པའི་ཚུལ་གྱིས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཀྱང་དེ་ལ་མི་གནས་སོ།
en: So it is, Subhūti, that bodhisattva great beings practice the path of enlightenment, but do not dwell in anything at all.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཀྱང་དེ་ལ་མི་གནས་སོ།
en: In a nondwelling manner, they practice the perfection of generosity but do not dwell in it, and they practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, but do not dwell in them. “

source: །དེ་བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་ཀྱང་དེ་ལ་མི་གནས་ཏེ།
en: They become absorbed in the first meditative concentration, but they do not dwell in it.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བསམ་གཏན་དང་པོ་ནི་བསམ་གཏན་གྱི་རང་བཞིན་གྱིས་སྟོང་ངོ་། །གང་མཉམ་པར་གཞོག་པ་དེ་ཡང་རང་བཞིན་གྱིས་སྟོང་ངོ་། །རྣམ་པ་གང་གིས་མཉམ་པར་བཞག་པའི་རྣམ་པ་དེ་དག་ཀྱང་རང་བཞིན་གྱིས་སྟོང་ངོ་། །དེ་བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག །བྱམས་པ་དང་། སྙིང་རྗེ་དང་།
en: If you ask why, it is because the first meditative concentration is empty of the inherent existence of meditative concentration, while those who become absorbed in it are also empty of inherent existence, and the aspects [of it] through which they become absorbed are also empty of inherent existence. {

source: དགའ་བ་དང་། བཏང་སྙོམས་ལ་སྙོམས་པར་འཇུག །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་།
en: Ki.

source: འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་ལ་སྙོམས་པར་འཇུག་ཀྱང་དེ་ལ་མི་གནས་ཏེ།
en: VIII: 122} They become absorbed in the second meditative concentration, the third meditative concentration, and the fourth meditative concentration; they become absorbed in loving kindness, compassion, empathetic joy, and equanimity; they become absorbed in the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception; and they become absorbed in the eight aspects of liberation, the nine serial steps of meditative absorption, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, emptiness, signlessness, wishlessness, and the extrasensory powers, but they do not dwell in them.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་མངོན་པར་ཤེས་པ་རྣམས་ནི། མངོན་པར་ཤེས་པ་རྣམས་ཀྱི་རང་བཞིན་གྱིས་སྟོང་ངོ་། །གང་མཉམ་པར་གཞོག་པ་དེ་ཡང་རང་བཞིན་གྱིས་སྟོང་ངོ་། །རྣམ་པ་གང་གིས་མཉམ་པར་གཞག་པའི་རྣམ་པ་དེ་དག་ཀྱང་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: If you ask why, it is because the extrasensory powers [and so forth] are empty of the inherent existence of the extrasensory powers [and so forth], while those who become absorbed in them are also empty of inherent existence, and the aspects [of them] through which they become absorbed are also empty of inherent existence. “

source: །དེ་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་འཐོབ་ཀྱང་དེ་ལ་མི་གནས་སོ།
en: They attain the fruit of entering the stream to nirvāṇa, but they do not dwell in it.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་དགྲ་བཅོམ་པ་ཉིད་འཐོབ་ཀྱང་དེ་ལ་མི་གནས་སོ།
en: They attain the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and arhatship, but they do not dwell in them.

source: །དེ་རང་བྱང་ཆུབ་འཐོབ་ཀྱང་དེ་ལ་མི་གནས་སོ།
en: Similarly, they attain individual enlightenment, but they do not dwell in it.” “

source: །གསོལ་པ། དེ་ཅིའི་སླད་དུ་མི་གནས།
en: Why do they not dwell in them?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྣམ་པ་གཉིས་ཀྱི་ཕྱིར་མི་གནས་ཏེ།
en: They do not dwell in them for two reasons,” replied the Blessed One. “

source: གཉིས་གང་ཞེ་ན།
en: What are those two, you may ask?

source: ངོ་བོ་ཉིད་དང་ངོ་བོ་ཉིད་མེད་པ་སྟེ།
en: They are the essential nature and the absence of essential nature.

source: དེ་གཉིས་ཀྱི་ཕྱིར་གང་ལ་གནས་པ་འམ། གང་གིས་གནས་པ་འམ། གང་གནས་པར་འགྱུར་བ་དེ་ལྟ་བུའི་འབྲས་བུ་དེ་དག་ལ་མེད་དོ།
en: Owing to these two, the fruits are nonexistent, be they [fruits] in which one might dwell, by which one might dwell, or which themselves dwell.

source: །དེ་ཙམ་གྱིས་དགའ་བར་ཡང་མི་འཛིན་ཏེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Just because of that they are not satisfied by them.

source: འདི་ལྟར་དེ་འདི་སྙམ་དུ་བདག་གིས་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པར་མི་བྱ་བ་མ་ཡིན་ཏེ།
en: If you ask why, it is because they think, ‘I should not attain the fruit of entering the stream to nirvāṇa!

source: དེ་ལ་གནས་པར་མི་བྱའོ།
en: I should not dwell in it.

source: །བདག་གིས་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཐོབ་པར་མི་བྱ་བ་མ་ཡིན་ཏེ།
en: I should not attain the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, or arhatship.

source: དེ་དག་ལ་གནས་པར་མི་བྱའོ།
en: I should not dwell in them.

source: །བདག་གིས་རང་སངས་རྒྱས་ཀྱི་སའི་བར་དུ་ཐོབ་པར་མི་བྱ་བ་མ་ཡིན་ཏེ།
en: I should not attain [the levels], up to and including the level of the pratyekabuddhas.

source: དེ་ལ་གནས་པ་མི་བྱའོ།
en: I should not dwell in them.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ།
en: I should attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བདག་གིས་ནི་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་མ་གཏོགས་པར།
en: If you ask why, commencing from the time when I first begin to set my mind on enlightenment, I will not develop any thoughts whatsoever, apart from setting the mind on unsurpassed, complete enlightenment.

source: སེམས་གཞན་གང་ཡང་མ་བསྐྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བདག་གིས་ནི་ས་དང་པོ་ནས་ཉེ་བར་བཟུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་མ་གཏོགས་པར།
en: If you ask why, commencing from the first [bodhisattva] level, up to the tenth [bodhisattva] level, I will not develop any thoughts whatsoever, apart from setting the mind on unsurpassed, complete enlightenment.

source: སེམས་གཞན་གང་ཡང་མ་བསྐྱེད་དོ། །བདག་གིས་ནི་ས་བཅུ་པའི་བར་ནས་ཉེ་བར་བཟུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་མ་གཏོགས་པར། སེམས་གཞན་གང་ཡང་མ་བསྐྱེད་དོ།
en: Commencing from [the other levels], up to and including the tenth level, I will not develop any thoughts whatsoever, apart from setting the mind on unsurpassed, complete enlightenment.

source: །བྱང་ཆུབ་སེམས་དཔའ་སྐྱོན་མེད་པར་ཞུགས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་མ་གཏོགས་པར། སེམས་གཞན་གང་ཡང་མ་བསྐྱེད་དོ་སྙམ་སྟེ།
en: Having entered upon the maturity of the bodhisattvas, I will not develop any thoughts whatsoever, apart from setting the mind on unsurpassed, complete enlightenment.’ “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་གཡེང་བ་མེད་པར་ལུས་སམ།
en: Subhūti, whatever the actions in which bodhisattva great beings undistractedly engage with body, {Ki.

source: ངག་གམ། ཡིད་ཀྱིས་ལས་གང་སྤྱོད་ཀྱང་རུང་སྟེ། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་མི་སྤྱོད་པ་མེད་དེ།
en: VIII: 123} speech, and mind, they do not cease to engage with the mind set on enlightenment.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ལ་གནས་ནས། ཡིད་གཡེང་བ་མེད་པར་ཡང་བྱང་ཆུབ་ཀྱི་ལམ་སྒྲུབ་བོ།
en: Abiding in the mind set on enlightenment, those bodhisattva great beings achieve the path of enlightenment without distraction.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་ལགས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། བྱང་ཆུབ་ཀྱི་ལམ་ཇི་ལྟར་བསྒྲུབ་པར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, if all phenomena are nonarising, how will bodhisattva great beings achieve the path of enlightenment?” “

source: ཆོས་ཐམས་ཅད་ནི་མ་སྐྱེས་པ་སྟེ།
en: All phenomena are nonarising.

source: དེ་ཇི་ལྟ་བུ་ཞེས་བྱས་ན། གང་མངོན་པར་འདུ་མི་བྱེད་པ་དེ་དག་ལ་ནི་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པའོ། །གསོལ་པ།
en: If you ask how that is so, all phenomena are nonarising for those who do not effect conditioning.” “

source: བཅོམ་ལྡན་འདས་འོ་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་། དེ་བཞིན་གཤེགས་པ་རྣམས་མ་བྱུང་ཡང་རུང་སྟེ། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ་བཞིན་དུ་གནས་པ་མ་ལགས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: On the other hand, Blessed Lord, is it not the case that, whether the tathāgatas have appeared or whether the tathāgatas have not appeared, the reality of phenomena dwells in that manner?” “

source: དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་། དེ་བཞིན་གཤེགས་པ་རྣམས་མ་བྱུང་ཡང་རུང་སྟེ། ཆོས་རྣམས་ཀྱི་གནས་ཉིད་ནི། དེ་བཞིན་དུ་གནས་སོ།
en: Whether the tathāgatas have appeared or whether the tathāgatas have not appeared, the abiding nature of phenomena dwells in that manner.

source: །དེ་ལ་ཡང་གང་ཆོས་ཀྱི་གནས་ཉིད་དེ་ལྟ་བུ་མི་ཤེས་པ་དེ་དག་གི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ལམ་བསྐྱེད་དེ།
en: And yet, for the sake of those who do not know this abiding nature of phenomena, bodhisattva great beings develop the path of enlightenment.

source: ལམ་དེས་སེམས་ཅན་རྣམས་འཁོར་བ་ལས་ཡོངས་སུ་ཐར་བར་བྱེད་དོ། །གསོལ་པ།
en: Through that path they liberate beings from cyclic existence.” “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། སྐྱེས་པར་གྱུར་པའི་ལམ་གྱིས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་བ་ལགས་སམ།
en: Blessed Lord, is enlightenment then attained by a path that arises?” “
